---
title: PointLocationOnCurve
classe: Autodesk.Revit.DB.PointLocationOnCurve
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# PointLocationOnCurve

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `pointLocationOnCurve.IsValidObject` | Boolean |
| `PointOnCurveMeasureFrom MeasureFrom { get; set; }` | `pointLocationOnCurve.MeasureFrom` | PointOnCurveMeasureFrom |
| `PointOnCurveMeasurementType MeasurementType { get; set; }` | `pointLocationOnCurve.MeasurementType` | PointOnCurveMeasurementType |
| `Double MeasurementValue { get; set; }` | `pointLocationOnCurve.MeasurementValue` | Double |
| `Void Dispose()` | `pointLocationOnCurve.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```